Repository: darviarush/perl-liveman
Catalog: i18n/Liveman/Cpanfile.*.po
Languages: ru_en

source: Liveman::Cpanfile - анализатор зависимостей Perl проекта
ru_en: Liveman::Cpanfile - Perl project dependency analyzer

source: `Liveman::Cpanfile` анализирует структуру Perl проекта и извлекает информацию о зависимостях из исходного кода, тестов и документации. Модуль автоматически определяет используемые модули и помогает поддерживать актуальный `cpanfile`.
ru_en: `Liveman::Cpanfile` parses the structure of a Perl project and extracts dependency information from source code, tests, and documentation. The module automatically detects which modules are used and helps keep the `cpanfile` up to date.

source: Конструктор.
ru_en: Constructor.

source: Преобразует путь к файлу в имя пакета Perl.
ru_en: Converts a file path to a Perl package name.

source: Возвращает список исполняемых скриптов в директориях `scripts/` и `bin/`.
ru_en: Returns a list of executable scripts in the `scripts/` and `bin/` directories.

source: Файл scripts/test_script:
ru_en: Scripts/test_script file:

source: Файл bin/tool:
ru_en: bin/tool file:

source: Возвращает список Perl модулей в директории `lib/`.
ru_en: Returns a list of Perl modules in the `lib/` directory.

source: Файл lib/My/Module.pm:
ru_en: File lib/My/Module.pm:

source: Файл lib/My/Other.pm:
ru_en: File lib/My/Other.pm:

source: Возвращает список имен пакетов проекта соответствующих модулям в директории `lib/`.
ru_en: Returns a list of project package names corresponding to the modules in the `lib/` directory.

source: Возвращает список Markdown файлов документации (`*.md`) в `lib/`.
ru_en: Returns a list of Markdown documentation files (`*.md`) in `lib/`.

source: Файл lib/My/Module.md:
ru_en: File lib/My/Module.md:

source: Список внедрённых в `*.md` пакетов.
ru_en: List of packages embedded in `*.md`.

source: Список зависимостей явно указанных в скриптах и модулях без пакетов проекта.
ru_en: List of dependencies explicitly specified in scripts and modules without project packages.

source: Список зависимостей из тестов за исключением:
ru_en: List of dependencies from tests except:

source: 1. Зависмостей скриптов и модулей. 2. Пакетов проекта. 3. Внедрённых в `*.md` пакетов.
ru_en: 1. Dependencies of scripts and modules. 2. Project packages. 3. Packages embedded in `*.md`.

source: Возвращает текст cpanfile c зависимостями для проекта.
ru_en: Returns the text cpanfile with dependencies for the project.
